arjun721/Smart_bms_bootloader/RTE/Device/HC32L072KATA/HC32L072KATA.h
typedef struct
{
    __IO uint32_t INEPTXSA                  :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t INEPTXFD                  :10;
} stc_usbfs_dieptxf1_field_t;

typedef struct
{
    __IO uint32_t INEPTXSA                  :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t INEPTXFD                  :10;
} stc_usbfs_dieptxf2_field_t;

typedef struct
{
    __IO uint32_t INEPTXSA                  :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t INEPTXFD                  :10;
} stc_usbfs_dieptxf3_field_t;

typedef struct
{
    __IO uint32_t INEPTXSA                  :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t INEPTXFD                  :10;
} stc_usbfs_dieptxf4_field_t;

typedef struct
{
    __IO uint32_t DSPD                      : 2;
    __IO uint32_t NZLSOHSK                  : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t DAD                       : 7;
    __IO uint32_t PFIVL                     : 2;
} stc_usbfs_dcfg_field_t;

typedef struct
{
    __IO uint32_t RWUSIG                    : 1;
    __IO uint32_t SDIS                      : 1;
    __IO uint32_t GINSTS                    : 1;
    __IO uint32_t GONSTS                    : 1;
    __IO uint32_t TCTL                      : 3;
    __IO uint32_t SGINAK                    : 1;
    __IO uint32_t CGINAK                    : 1;
    __IO uint32_t SGONAK                    : 1;
    __IO uint32_t CGONAK                    : 1;
    __IO uint32_t POPRGDNE                  : 1;
} stc_usbfs_dctl_field_t;

typedef struct
{
    __IO uint32_t SUSPSTS                   : 1;
    __IO uint32_t ENUMSPD                   : 2;
    __IO uint32_t EERR                      : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t FNSOF                     :14;
} stc_usbfs_dsts_field_t;

typedef struct
{
    __IO uint32_t XFRCM                     : 1;
    __IO uint32_t EPDM                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOM                       : 1;
    __IO uint32_t ITTXFEMSK                 : 1;
    __IO uint32_t INEPNMM                   : 1;
    __IO uint32_t IINEPNEM                  : 1;
} stc_usbfs_diepmsk_field_t;

typedef struct
{
    __IO uint32_t XFRCM                     : 1;
    __IO uint32_t EPDM                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STUPM                     : 1;
    __IO uint32_t OTEPDM                    : 1;
} stc_usbfs_doepmsk_field_t;

typedef struct
{
    __IO uint32_t IEPINT                    : 6;
    uint32_t RESERVED6                      :10;
    __IO uint32_t OEPINT                    : 6;
} stc_usbfs_daint_field_t;

typedef struct
{
    __IO uint32_t IEPINTM                   :16;
    __IO uint32_t OEPINTM                   :16;
} stc_usbfs_daintmsk_field_t;

typedef struct
{
    __IO uint32_t INEPTXFEM                 :16;
} stc_usbfs_diepempmsk_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t EONUM_DPID                : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID_SEVNFRM            : 1;
    __IO uint32_t SODDFRM                   : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_diepctl0_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOC                       : 1;
    __IO uint32_t TTXFE                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t NEPNE                     : 1;
    __IO uint32_t TXFE                      : 1;
} stc_usbfs_diepint0_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    : 7;
    uint32_t RESERVED7                      :12;
    __IO uint32_t PKTCNT                    : 2;
} stc_usbfs_dieptsiz0_field_t;

typedef struct
{
    __IO uint32_t INEPTFSAV                 :16;
} stc_usbfs_dtxfsts0_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t EONUM_DPID                : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID_SEVNFRM            : 1;
    __IO uint32_t SODDFRM                   : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_diepctl1_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOC                       : 1;
    __IO uint32_t TTXFE                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t NEPNE                     : 1;
    __IO uint32_t TXFE                      : 1;
} stc_usbfs_diepint1_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usbfs_dieptsiz1_field_t;

typedef struct
{
    __IO uint32_t INEPTFSAV                 :16;
} stc_usbfs_dtxfsts1_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t EONUM_DPID                : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID_SEVNFRM            : 1;
    __IO uint32_t SODDFRM                   : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_diepctl2_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOC                       : 1;
    __IO uint32_t TTXFE                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t NEPNE                     : 1;
    __IO uint32_t TXFE                      : 1;
} stc_usbfs_diepint2_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usbfs_dieptsiz2_field_t;

typedef struct
{
    __IO uint32_t INEPTFSAV                 :16;
} stc_usbfs_dtxfsts2_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t EONUM_DPID                : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID_SEVNFRM            : 1;
    __IO uint32_t SODDFRM                   : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_diepctl3_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOC                       : 1;
    __IO uint32_t TTXFE                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t NEPNE                     : 1;
    __IO uint32_t TXFE                      : 1;
} stc_usbfs_diepint3_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usbfs_dieptsiz3_field_t;

typedef struct
{
    __IO uint32_t INEPTFSAV                 :16;
} stc_usbfs_dtxfsts3_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t EONUM_DPID                : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID_SEVNFRM            : 1;
    __IO uint32_t SODDFRM                   : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_diepctl4_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOC                       : 1;
    __IO uint32_t TTXFE                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t NEPNE                     : 1;
    __IO uint32_t TXFE                      : 1;
} stc_usbfs_diepint4_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usbfs_dieptsiz4_field_t;

typedef struct
{
    __IO uint32_t INEPTFSAV                 :16;
} stc_usbfs_dtxfsts4_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    __IO uint32_t SNPM                      : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    uint32_t RESERVED28                     : 2;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_doepctl0_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STUP                      : 1;
    __IO uint32_t OTEPDIS                   : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t B2BSTUP                   : 1;
} stc_usbfs_doepint0_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    : 7;
    uint32_t RESERVED7                      :12;
    __IO uint32_t PKTCNT                    : 1;
    uint32_t RESERVED20                     : 9;
    __IO uint32_t STUPCNT                   : 2;
} stc_usbfs_doeptsiz0_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    __IO uint32_t SNPM                      : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID                    : 1;
    __IO uint32_t SD1PID                    : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_doepctl1_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STUP                      : 1;
    __IO uint32_t OTEPDIS                   : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t B2BSTUP                   : 1;
} stc_usbfs_doepint1_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
} stc_usbfs_doeptsiz1_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    __IO uint32_t SNPM                      : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID                    : 1;
    __IO uint32_t SD1PID                    : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_doepctl2_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STUP                      : 1;
    __IO uint32_t OTEPDIS                   : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t B2BSTUP                   : 1;
} stc_usbfs_doepint2_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
} stc_usbfs_doeptsiz2_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    __IO uint32_t SNPM                      : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID                    : 1;
    __IO uint32_t SD1PID                    : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_doepctl3_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STUP                      : 1;
    __IO uint32_t OTEPDIS                   : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t B2BSTUP                   : 1;
} stc_usbfs_doepint3_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
} stc_usbfs_doeptsiz3_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    __IO uint32_t SNPM                      : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID                    : 1;
    __IO uint32_t SD1PID                    : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_doepctl4_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STUP                      : 1;
    __IO uint32_t OTEPDIS                   : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t B2BSTUP                   : 1;
} stc_usbfs_doepint4_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
} stc_usbfs_doeptsiz4_field_t;

typedef struct
{
    __IO uint32_t STPPCLK                   : 1;
    __IO uint32_t GATEHCLK                  : 1;
} stc_usbfs_pcgcctl_field_t;

typedef struct
{
    __IO uint32_t DIV                       : 6;
    __IO uint32_t DIV_EN                    : 1;
    __IO uint32_t REF2P5_SEL                : 1;
    __IO uint32_t VC0_BIAS_SEL              : 2;
    __IO uint32_t VC0_HYS_SEL               : 2;
    __IO uint32_t VC1_BIAS_SEL              : 2;
    __IO uint32_t VC1_HYS_SEL               : 2;
    __IO uint32_t VC2_BIAS_SEL              : 2;
    __IO uint32_t VC2_HYS_SEL               : 2;
    uint32_t RESERVED20                     :11;
    __IO uint32_t RSV                       : 1;
} stc_vc_cr_field_t;

typedef struct
{
    __IO uint32_t P_SEL                     : 4;
    __IO uint32_t N_SEL                     : 4;
    __IO uint32_t FLTEN                     : 1;
    __IO uint32_t DEBOUNCE_TIME             : 3;
    __IO uint32_t FALLING                   : 1;
    __IO uint32_t RISING                    : 1;
    __IO uint32_t LEVEL                     : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t EN                        : 1;
    uint32_t RESERVED17                     :14;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc0_cr_field_t;

typedef struct
{
    __IO uint32_t P_SEL                     : 4;
    __IO uint32_t N_SEL                     : 4;
    __IO uint32_t FLTEN                     : 1;
    __IO uint32_t DEBOUNCE_TIME             : 3;
    __IO uint32_t FALLING                   : 1;
    __IO uint32_t RISING                    : 1;
    __IO uint32_t LEVEL                     : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t EN                        : 1;
    uint32_t RESERVED17                     :14;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc1_cr_field_t;

typedef struct
{
    __IO uint32_t INV_TIMER                 : 1;
    __IO uint32_t TIM0RCLR                  : 1;
    __IO uint32_t TIM1RCLR                  : 1;
    __IO uint32_t TIM2RCLR                  : 1;
    __IO uint32_t TIM3RCLR                  : 1;
    __IO uint32_t TIMBK                     : 1;
    uint32_t RESERVED6                      : 3;
    __IO uint32_t INV_TIM4                  : 1;
    __IO uint32_t TIM4                      : 1;
    __IO uint32_t INV_TIM5                  : 1;
    __IO uint32_t TIM5                      : 1;
    __IO uint32_t INV_TIM6                  : 1;
    __IO uint32_t TIM6                      : 1;
    __IO uint32_t BRAKE                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc0_out_cfg_field_t;

typedef struct
{
    __IO uint32_t INV_TIMER                 : 1;
    __IO uint32_t TIM0RCLR                  : 1;
    __IO uint32_t TIM1RCLR                  : 1;
    __IO uint32_t TIM2RCLR                  : 1;
    __IO uint32_t TIM3RCLR                  : 1;
    __IO uint32_t TIMBK                     : 1;
    uint32_t RESERVED6                      : 3;
    __IO uint32_t INV_TIM4                  : 1;
    __IO uint32_t TIM4                      : 1;
    __IO uint32_t INV_TIM5                  : 1;
    __IO uint32_t TIM5                      : 1;
    __IO uint32_t INV_TIM6                  : 1;
    __IO uint32_t TIM6                      : 1;
    __IO uint32_t BRAKE                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc1_out_cfg_field_t;

typedef struct
{
    __IO uint32_t VC0_INTF                  : 1;
    __IO uint32_t VC1_INTF                  : 1;
    __IO uint32_t VC0_FILTER                : 1;
    __IO uint32_t VC1_FILTER                : 1;
    __IO uint32_t VC2_INTF                  : 1;
    __IO uint32_t VC2_FILTER                : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RSV                       : 1;
} stc_vc_ifr_field_t;

typedef struct
{
    __IO uint32_t P_SEL                     : 4;
    __IO uint32_t N_SEL                     : 4;
    __IO uint32_t FLTEN                     : 1;
    __IO uint32_t DEBOUNCE_TIME             : 3;
    __IO uint32_t FALLING                   : 1;
    __IO uint32_t RISING                    : 1;
    __IO uint32_t LEVEL                     : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t EN                        : 1;
    uint32_t RESERVED17                     :14;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc2_cr_field_t;

typedef struct
{
    __IO uint32_t INV_TIMER                 : 1;
    __IO uint32_t TIM0RCLR                  : 1;
    __IO uint32_t TIM1RCLR                  : 1;
    __IO uint32_t TIM2RCLR                  : 1;
    __IO uint32_t TIM3RCLR                  : 1;
    __IO uint32_t TIMBK                     : 1;
    uint32_t RESERVED6                      : 3;
    __IO uint32_t INV_TIM4                  : 1;
    __IO uint32_t TIM4                      : 1;
    __IO uint32_t INV_TIM5                  : 1;
    __IO uint32_t TIM5                      : 1;
    __IO uint32_t INV_TIM6                  : 1;
    __IO uint32_t TIM6                      : 1;
    __IO uint32_t BRAKE                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc2_out_cfg_field_t;

typedef struct
{
    __IO uint32_t RST                       : 8;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_wdt_rst_field_t;

typedef struct
{
    __IO uint32_t WOV                       : 4;
    __IO uint32_t R                         : 1;
    __IO uint32_t WINT_EN                   : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t INT                       : 1;
    __IO uint32_t WCNTL                     : 8;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_wdt_con_field_t;


